{
  "name": "AgentWallet Protocol",
  "description": "Full-stack wallet-as-a-service protocol on Solana for autonomous AI agents. Spending limits, trustless escrow, policy engine, compliance, and 27 MCP tools — purpose-built for the agentic economy. Live API, SDK on PyPI, dashboard, and quest campaign. Endorsed by toly (Solana co-founder).",
  "repoLink": "https://github.com/YouthAIAgent/agentwallet",
  "liveAppLink": "https://agentwallet.fun",
  "presentationLink": "",
  "twitterHandle": "@agentwallet_pro",
  "tags": ["defi", "infrastructure", "ai"],
  "solanaIntegration": "On-chain Anchor/Rust program (CEQLGCWkpUjbsh5kZujTaCkFB59EKxmnhsqydDzpt6r6) with 3 PDA types: AgentWallet (per-tx + daily spending limits), EscrowAccount (trustless fund locking with funder/recipient/arbiter roles), PlatformConfig (fee configuration). 7 Anchor instructions: create_agent_wallet, transfer_with_limit (enforces limits, deducts fee, transfers SOL), update_limits, create_escrow, release_escrow, refund_escrow, initialize_platform_config. PDA seeds: [\"agent_wallet\", org, agent_id], [\"escrow\", escrow_id], [\"platform_config\"]. Escrow PDAs close on release/refund to reclaim rent. All transactions on Solana devnet with solders Python SDK for backend signing. Uses Solana's native account model — no EVM adaptation, pure PDA-first architecture that toly endorsed as 'EVM minds cannot comprehend this'.",
  "problemStatement": "AI agents are autonomous economic actors — they negotiate, trade, pay for services. But they use human wallets never designed for programmatic control. Result: no spending limits (compromised agent drains everything), no escrow (no trustless agent-to-agent payments), no audit trail (zero visibility into agent spending), no compliance (no EU AI Act/SOX framework), key management nightmare (private keys in .env files). Every major AI lab ships agent frameworks but none solved the wallet problem. The agentic economy needs purpose-built financial infrastructure — not adapted human wallets. Market: $65B AI agent market by 2030, every agent needs a wallet. AgentWallet is that infrastructure layer.",
  "technicalApproach": "10-layer agentic commerce stack on Solana. On-chain: Anchor/Rust program with 3 PDA types (AgentWallet, EscrowAccount, PlatformConfig) and 7 instructions. Backend: FastAPI + PostgreSQL + Redis with 13 API routers (68 endpoints), 16 SQLAlchemy models, 7 background workers. Permission Engine evaluates JSON policy rules on every tx (spending limits, daily caps, whitelists, time windows, approval thresholds). Dual auth (JWT + API keys). Python SDK on PyPI (v0.2.0) with Stripe-like async client. 27 MCP tools for AI agent integration. React dashboard (9 pages). Supabase-backed quest campaign with anti-tamper verification. Security: HSTS, CSP, encrypted keys (Fernet/KMS), HMAC-SHA256 API key hashing, rate limiting. 53/53 tests passing.",
  "targetAudience": "Primary: AI agent developers building autonomous agents that transact (trading bots, data procurement, service agents). AI startups deploying agent fleets managing funds. MCP tool builders wanting plug-and-play financial capabilities. Secondary: DeFi protocols integrating agent-based trading/liquidity. Enterprise AI teams needing compliant, auditable agent financial ops. DAOs using agents for treasury management with programmatic controls. The AI agent market hits $65B by 2030 — every one needs a wallet.",
  "businessModel": "Three revenue streams: (1) Transaction fees — basis point fee on every on-chain transaction, configurable per deployment. (2) Tiered API: Free ($0, 100 agents, 10K tx/mo, 0.5% fee), Pro ($49/mo, 1K agents, 100K tx/mo, 0.25% fee), Enterprise (custom, unlimited, 0.1% fee, SLA). (3) Self-hosted license — open-source core (MIT), premium enterprise features. Unit economics: near-zero marginal cost (Solana fees ~$0.00025/tx), revenue scales linearly with agent economy growth, platform fees compound as agent-to-agent commerce increases.",
  "competitiveLandscape": "Coinbase CDP: General wallet SDK, not agent-specific — we're agent-native with PDAs, policies, escrow from day one. Crossmint: NFT/wallet API — no spending limits, no escrow, no compliance. Dynamic.xyz: Embedded wallets for humans, not autonomous agents. Turnkey: Low-level key management — no policy engine, analytics, or MCP integration. Circle CCTP: Payment rail only — no agent identity or programmatic control. Our moat: purpose-built for the agentic economy, not a human wallet adapted for agents. Endorsed by Solana co-founder toly. Full stack from on-chain PDAs to MCP tools.",
  "futureVision": "Q1 2026 (Now): Core protocol live on Solana devnet, Python SDK v0.2.0 on PyPI, 27 MCP tools, security audit complete (8 fixes), dashboard + CLI, agent marketplace, x402 payments, ERC-8004 identity, quest campaign. Q2: Mainnet deployment, TypeScript SDK, cross-chain balance aggregation. Q3: Multi-chain expansion (Base, Arbitrum, Polygon), enterprise compliance (SOX, EU AI Act). Q4: Stablecoin settlement (USDC/USDT), account abstraction (gasless tx, session keys), ML anomaly detection, 10K+ agents. 2027: Default wallet infra for every AI agent framework, protocol interop with Anthropic/OpenAI/Google."
}
